## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.name_servers["ns1-33.azure-dns.com."] will be updated in-place
  ~ resource "cloudflare_record" "name_servers" {
        id              = "2d49d6bf9a93b5673db44df3d3967b31"
        name            = "games.ruut.me"
        tags            = []
      + value           = "ns1-33.azure-dns.com."
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.name_servers["ns2-33.azure-dns.net."] will be updated in-place
  ~ resource "cloudflare_record" "name_servers" {
        id              = "a319bd9e17c49661abca9c3234d73aa4"
        name            = "games.ruut.me"
        tags            = []
      + value           = "ns2-33.azure-dns.net."
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.name_servers["ns3-33.azure-dns.org."] will be updated in-place
  ~ resource "cloudflare_record" "name_servers" {
        id              = "294950b22b88b425a1584cb935bd5417"
        name            = "games.ruut.me"
        tags            = []
      + value           = "ns3-33.azure-dns.org."
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.name_servers["ns4-33.azure-dns.info."] will be updated in-place
  ~ resource "cloudflare_record" "name_servers" {
        id              = "91b666cdbedabc3e6c89582c8ce45300"
        name            = "games.ruut.me"
        tags            = []
      + value           = "ns4-33.azure-dns.info."
        # (10 unchanged attributes hidden)
    }

  # module.virtual_machines["cs1"].azurerm_dns_a_record.game_record will be created
  + resource "azurerm_dns_a_record" "game_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cs1"
      + records             = (known after apply)
      + resource_group_name = "cs2-servers"
      + ttl                 = 300
      + zone_name           = "games.ruut.me"
    }

  # module.virtual_machines["cs1"].azurerm_linux_virtual_machine.game will be created
  + resource "azurerm_linux_virtual_machine" "game" {
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "swedencentral"
      + max_bid_price                                          = -1
      + name                                                   = "cs1"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "cs2-servers"
      + size                                                   = "Standard_D4as_v5"
      + user_data                                              = (sensitive value)
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvY9YBkn72I68uqx4xBElJaZNW/J69Yt/UcS6cGUKUjc5JVs4qYW5Mpn/c4gDWqeSupTb1DAb0sK50kSX+wUCqZH1P6RCSzM8/1rs2kwRcNvNEtqc8/S0hvz9aQunmBft/8YgmhvYGQiboUNkZQAWVlyvCS3lcDBdcq0YUzi4TAz35EcxlGsP2uTCuUGYpgsHIwYNvMYnRlOAzLXKszYf7xL1kwMz4xQDXZh+ggP2prcVCIRnaOBL18aiqaI+QLiVYZpx0qHRaMj2nvJ5goynus1iulrY3R0wmz8e6KkyGI4TfM+yoj0RKl9hfmq1jcXb+aer507s0l8tIqp26BLFQJv1vZjAIWiJ090C6dr/zkgKRVTh0+FsVEWxgC7O0epaUPTN0+Oxpi2itsW8TIm/rteturACLEcTza81ZUHbXZh38OzUaU0SaVpCPmOLn9F4rBXD6QkgWNdjOV8i+0A4u0/xFC1J1rmpINIJOe/llWK6+qkndIcN+4IlVg6Fw4IU= ekos@DESKTOP-QIMMA0H"
          + username   = "adminuser"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 50
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "24_04-lts"
          + version   = "latest"
        }
    }

  # module.virtual_machines["cs1"].azurerm_network_interface.game will be created
  + resource "azurerm_network_interface" "game" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "swedencentral"
      + mac_address                    = (known after apply)
      + name                           = "cs1-game-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "cs2-servers"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/virtualNetworks/cs-network/subnets/internal"
        }
    }

  # module.virtual_machines["cs1"].azurerm_network_interface_security_group_association.example will be created
  + resource "azurerm_network_interface_security_group_association" "example" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/cs2-servers/providers/Microsoft.Network/networkSecurityGroups/allow_cs_connections"
    }

  # module.virtual_machines["cs1"].azurerm_public_ip.game will be created
  + resource "azurerm_public_ip" "game" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "swedencentral"
      + name                    = "cs1PublicIp1"
      + resource_group_name     = "cs2-servers"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "hostName" = "cs1"
        }
    }

Plan: 5 to add, 4 to change, 0 to destroy.
```
</details>